#include "jroboterrortext.h"

QJsonObject getErrorData(int code)
{
    QJsonObject data;
    data["deviceId"] = 1;
    data["code"] = 2;//2报错 =3报警
    data["popup"] = true;//true需要弹窗
    data["key"] = code;//true需要弹窗
    switch (code)
    {
    case 0x0F0001:
    {
        data["describe"] = "机器人本体当前没有通电";
        data["cause"] = "控制器执行指令时，检测到机器人未上电";
        data["solution"] = "确认机器人本体电源是否打开；如果机器人本体电源未打开，请首先打开机器人本体电源";
        break;
    }
    case 0x0F0002:
    {
        data["describe"] = "机器人当前没有使能";
        data["cause"] = "控制器执行指令时检测到机器人未使能";
        data["solution"] = "确认机器人使能是否打开；如果未打开，请先开启机器人使能";
        break;
    }
    case 0x0F0003:
    {
        data["describe"] = "当前模式下无法进行此操作。当前在模式，不允许执行命令";
        data["cause"] = "控制器内部具有多种模式，特定的操作进允许在特定的模式下运行。模式的切换由内部自动完成，当出现该问题时为未妥善处理的操作权限导致";
        data["solution"] = "先退出当前模式，再进行操作，例如将机器人下使能后再继续操作";
        break;
    }
    case 0x0F0004:
    {
        data["describe"] = "运动学逆解计算失败";
        data["cause"] = "运动学逆解计算失败，原因如下： （1）给定笛卡尔空间位姿超出机器人可达空间； （2）给定笛卡尔空间位姿在给定的参考角度确定的解空间内无解。";
        data["solution"] = "（1）在手动界面中进入坐标编辑界面，输入点位信息进行验证； （2）手动jog，检查机器人目标点或目标路径位姿姿态是否可达，如果可达请更换姿态进行运动学逆解计算。";
        break;
    }
    case 0x0F0005:
    {
        data["describe"] = "位置设置过大";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F0006:
    {
        data["describe"] = "机器人关节达到正的硬限位 不可运动";
        data["cause"] = "JOG运动时，机器人已经到达限位，但指令仍然往限位方向运动。";
        data["solution"] = "检查机器人当前位置是否已到达限位，机器人运动无法超过限位。";
        break;
    }
    case 0x0F0007:
    {
        data["describe"] = "机器人关节达到负的硬限位 不可运动";
        data["cause"] = "JOG运动时，机器人已经到达限位，但指令仍然往限位方向运动。";
        data["solution"] = "检查机器人当前位置是否已到达限位，机器人运动无法超过限位。";
        break;
    }
    case 0x0F0008:
    {
        data["describe"] = "机器人关节达到正的软限位 不可运动";
        data["cause"] = "JOG运动时，机器人已经到达限位，但指令仍然往限位方向运动。";
        data["solution"] = "检查机器人当前位置是否已到达限位，机器人运动无法超过限位。";
        break;
    }
    case 0x0F0009:
    {
        data["describe"] = "机器人关节达到负的软限位 不可运动";
        data["cause"] = "JOG运动时，机器人已经到达限位，但指令仍然往限位方向运动。";
        data["solution"] = "检查机器人当前位置是否已到达限位，机器人运动无法超过限位。";
        break;
    }
    case 0x0F000A:
    {
        data["describe"] = "目标位置超过正的最大位置限制";
        data["cause"] = "笛卡尔空间运动给定的指令位置超过轴的最大限制。";
        data["solution"] = "请检查给定笛卡尔空间目标是否超过臂展范围。";
        break;
    }
    case 0x0F000B:
    {
        data["describe"] = "目标位置超过负的最大位置限制";
        data["cause"] = "笛卡尔空间运动给定的指令位置超过轴的最大限制。";
        data["solution"] = "请检查给定笛卡尔空间目标是否超过臂展范围。";
        break;
    }
    case 0x0F000E:
    {
        data["describe"] = "Home过程中无法手动操作";
        data["cause"] = "机器人回零设置过程中进行了机器人的手动运动控制。";
        data["solution"] = "确认机器人当前是否正在回零，如是则等待机器人回零过程完成后继续操作。";
        break;
    }
    case 0x0F000F:
    {
        data["describe"] = "指令关节索引无效";
        data["cause"] = "控制笛卡尔空间单轴或者关节空间单关节运动时，给定轴/关节索引无效导致。";
        data["solution"] = "请检查指令中所给索引是否正确；如果指令正确，请导出日志联系JAKA技术服务人员。";
        break;
    }
    case 0x0F0010:
    {
        data["describe"] = "运动指令速度无效";
        data["cause"] = "内部预留";
        data["solution"] = "内部预留";
        break;
    }
    case 0x0F0011:
    {
        data["describe"] = "运动指令目标位置超过机器限制";
        data["cause"] = "关节运动、或直线运动的目标位置超过机器人的限位。";
        data["solution"] = "手动jog ，检查目标位置是否可达，是否会超过关节限位。";
        break;
    }
    case 0x0F0012:
    {
        data["describe"] = "非关节模式不能进行home操作";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F0013:
    {
        data["describe"] = "Home正在进行";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F0014:
    {
        data["describe"] = "退出保护模式失败";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F0015:
    {
        data["describe"] = "机器人未启动";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F0016:
    {
        data["describe"] = "运动指令目标位置不可达";
        data["cause"] = "运动指令目标位置不可达。";
        data["solution"] = "目标位置超出工作范围或处于奇异点。 手动操作检查是否能关节运动到目标点，如果可以，考虑改变当前机器人的姿态，从其它的路径或姿态到达目标点";
        break;
    }
    case 0x0F0018:
    {
        data["describe"] = "到达奇异点保护性停止";
        data["cause"] = "机器人在运动路径中即将达到奇异构型，无法继续进行笛卡尔空间运动。该错误一般在计算逆解时出错或者计算逆解与上一周期处于不同解空间时报出。";
        data["solution"] = "检查当前机器人路径及姿态是否可达，如不可达，更换初始姿态或路径来到达目标位置。如确认指令路径没有问题，请收集相关数据并联系JAKA技术服务人员。";
        break;
    }
    case 0x0F0019:
    {
        data["describe"] = "CAN设备初始化失败";
        data["cause"] = "CAN设备初始化失败";
        data["solution"] = "离线仿真环境下，没有CAN设备导致报错，后续优化。实际机器环境下，请重启机器人，若持续出现请联系JAKA技术服务人员。";
        break;
    }
    case 0x0F001A:
    {
        data["describe"] = "一键升级超时";
        data["cause"] = "一键升级时间过长";
        data["solution"] = "请检查网络情况以及设备情况后再进行作业。";
        break;
    }
    case 0x0F001B:
    {
        data["describe"] = "一键升级异常";
        data["cause"] = "一键升级失败";
        data["solution"] = "请检查一键升级包的来源与有效性。";
        break;
    }
    case 0x0F0020:
    {
        data["describe"] = "直线运动到目标位置失败";
        data["cause"] = "直线运动到目标位置失败。一般笛卡尔运动（直线或圆弧运动）过程中经过奇异点时报出，尤其是初始点或终止点为奇异点时。";
        data["solution"] = "直线运动路径点或目标点不可达或经过奇异点，手动操作检查是否能关节运动到目标点，如果可以，考虑改变当前机器人的姿态，从其它的路径或姿态到达目标点。 注意：由于程序指针会超前实际动作指针，因此该错误提示可能会提前触发，即解析到了但还未执行到对应行时就会报出。在处理该问题时请检查作业程序中后续指令是否基于当前位置皆可达。";
        break;
    }
    case 0x0F0021:
    {
        data["describe"] = "机器人型号不支持";
        data["cause"] = "机器人型号不支持。一般来说最新的控制器软件会支持现有的所有机器人模型，但在旧的控制器软件上连接新的型号的机器人会出现该问题。出现该问题时，机器人的DH参数、动力学参数以及各项限制均可能错误，谨慎上使能控制。";
        data["solution"] = "APP信息页面查看机器人序列号，联系JAKA获取支持的软件版本";
        break;
    }
    case 0x0F0022:
    {
        data["describe"] = "机器人序列号无效";
        data["cause"] = "机器人序列号无效。控制器软件支持特定的机器人型号，特定的机器人型号具有特定的编码规则。实际机器上机器人的序列号从伺服读出，如果序列号不满足支持的型号与规则，则会报错。";
        data["solution"] = "APP信息页面查看机器人序列号，查看机器人本体实际序列号，检查序列号是否配置正确。如序列号正确，请联系JAKA获取最新版本。";
        break;
    }
    case 0x0F0023:
    {
        data["describe"] = "负载辨识轨迹索引无效";
        data["cause"] = "系统内部发送错误";
        data["solution"] = "重新进行负载辨识；更新控制器；联系JAKA获取支持";
        break;
    }
    case 0x0F0024:
    {
        data["describe"] = "倍率模式下无法设置倍率";
        data["cause"] = "倍率模式下无法设置倍率。该错误一般在机器人处于倍率模式或者保护性停止模式下进行倍率设置。";
        data["solution"] = "请检查机器人当前是否处于倍率模式，如果是请先退出倍率模式，再设置倍率；如果机器人未处于倍率模式，请确认当前软件版本，并联系JAKA技术服务人员。";
        break;
    }
    case 0x0F0025:
    {
        data["describe"] = "负载辨识轨迹定义不满足规范";
        data["cause"] = "负载辨识轨迹定义不满足规范。机器人负载辨识需要满足一定的约束以保证辨识结果的准确性。用户输入不满足提示要求时，会提示该问题。";
        data["solution"] = "请按照APP负载辨识界面的提示的轨迹规范进行操作，重新进行负载辨识。";
        break;
    }
    case 0x0F0026:
    {
        data["describe"] = "关闭电源之前请下使能";
        data["cause"] = "关闭电源之前请下使能";
        data["solution"] = "关闭电源之前请下使能";
        break;
    }
    case 0x0F0027:
    {
        data["describe"] = "程序运行期间不能下使能";
        data["cause"] = "程序运行期间不能下使能";
        data["solution"] = "请先停止程序，再下使能。";
        break;
    }
    case 0x0F0028:
    {
        data["describe"] = "负载设置存在偏差 请检查";
        data["cause"] = "负载设置存在偏差 请检查。机器人上使能后进行负载自检。如果机器人实际输出力矩与前馈力矩偏差超出一定范围时，则报该错并下使能。";
        data["solution"] = "1）请检查负载质量和质心设置是否正确；2）请检查机器人型号、序列号是否正确识别。";
        break;
    }
    case 0x0F0029:
    {
        data["describe"] = "添加圆弧运动指令失败";
        data["cause"] = "添加圆弧运动示教的三点共线或有奇异位置";
        data["solution"] = "1). 请检查圆弧运动的起点、中间点、终点是否重合； 2). 请检查圆弧运动的起点、中间点、终点是否是奇异位置；";
        break;
    }
    case 0x0F0030:
    {
        data["describe"] = "关节速度限制被设置为0";
        data["cause"] = "关节速度的限制值为0";
        data["solution"] = "检查APP安全设置界面中的“关节速度限制”值是否有被设置为0°/s";
        break;
    }
    case 0x0F0031:
    {
        data["describe"] = "三位置使能限制";
        data["cause"] = "安全设置中配置并开启三位置使能安全功能。";
        data["solution"] = "三位置使能安全功能对于机器人控制存在约束情况，请检查三位置开关状态，或根据安全情况选择关闭三位置使能功能。/s";
        break;
    }
    case 0x0F0032:
    {
        data["describe"] = "无法对直线或圆弧运动外的运动类型进行跟踪";
        data["cause"] = "传送带跟踪只能对笛卡尔空间运动类型进行跟踪，而传送带跟踪模块中嵌套了直线运动和圆弧运动以外的运动类型。";
        data["solution"] = "请检查传送带跟踪中是否嵌套了非直线运动和圆滑运动的其他运动类型模块；/s";
        break;
    }
    case 0x0F0038:
    {
        data["describe"] = "添加关节运动指令失败";
        data["cause"] = "关节运动段设置不合理";
        data["solution"] = "1)请确认当前机器人关节位置和目标关节位置是否正确";
        break;
    }
    case 0x0F0039:
    {
        data["describe"] = "TCP标定示教点重复";
        data["cause"] = "示教点中存在两个或两个以上示教点重合";
        data["solution"] = "请重新标定TCP，并确保没有重合的点位";
        break;
    }
    case 0x0F003A:
    {
        data["describe"] = "机器人运动过程中不允许下使能";
        data["cause"] = "机器人运动过程中不允许下使能";
        data["solution"] = "请先停止操作机器人再下使能";
        break;
    }
    case 0x0F003B:
    {
        data["describe"] = "机器人已上电，无需重复上电";
        data["cause"] = "机器人已上电，无需重复上电";
        data["solution"] = "机器人已上电，无需重复上电";
        break;
    }
    case 0x0F003C:
    {
        data["describe"] = "机器人已使能，无需重复使能";
        data["cause"] = "机器人已使能，无需重复使能";
        data["solution"] = "机器人已使能，无需重复使能";
        break;
    }
    case 0x0F003D:
    {
        data["describe"] = "TCP坐标系的标定有示教点在同一条直线上的情况";
        data["cause"] = "示教点位在同一直线上会导致无法计算TCP的姿态。";
        data["solution"] = "请重新设置合适的示教点位。";
        break;
    }
    case 0x0F003E:
    {
        data["describe"] = "TCP坐标系的标定误差超过预设阈值";
        data["cause"] = "TCP坐标系的标定误差超过预设阈值";
        data["solution"] = "请重新设置合适的示教点位。";
        break;
    }
    case 0x0F003F:
    {
        data["describe"] = "TCP坐标系的标定坐标超出了工作空间";
        data["cause"] = "TCP坐标系的标定坐标超出了工作空间";
        data["solution"] = "请重新设置合适的示教点位。";
        break;
    }
    case 0x000030:
    {
        data["describe"] = "关节一运动速度超过限制";
        data["cause"] = "关节一运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x010030:
    {
        data["describe"] = "关节二运动速度超过限制";
        data["cause"] = "关节二运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x020030:
    {
        data["describe"] = "关节三运动速度超过限制";
        data["cause"] = "关节三运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x030030:
    {
        data["describe"] = "关节四运动速度超过限制";
        data["cause"] = "关节四运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x040030:
    {
        data["describe"] = "关节五运动速度超过限制";
        data["cause"] = "关节五运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x050030:
    {
        data["describe"] = "关节六运动速度超过限制";
        data["cause"] = "关节六运动速度超过限制。该错误一般在控制器下发指令超出关节实际限速时报错。";
        data["solution"] = "1）请确认当前机器人的速度约束是否被人为修改提高过，是的话联系JAKA技术人员 2）如果未修改过但报错，请确认降低速度或加速度约束是否能够消除现象；如果仍然出现，请将相应诊断信息导出，并联系JAKA技术服务人员。";
        break;
    }
    case 0x000031:
    {
        data["describe"] = "关节一到达正软限位";
        data["cause"] = "关节一到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x010031:
    {
        data["describe"] = "关节二到达正软限位";
        data["cause"] = "关节二到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x020031:
    {
        data["describe"] = "关节三到达正软限位";
        data["cause"] = "关节三到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x030031:
    {
        data["describe"] = "关节四到达正软限位";
        data["cause"] = "关节四到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x040031:
    {
        data["describe"] = "关节五到达正软限位";
        data["cause"] = "关节五到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x050031:
    {
        data["describe"] = "关节六到达正软限位";
        data["cause"] = "关节六到达正软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x000032:
    {
        data["describe"] = "关节一到达负软限位";
        data["cause"] = "关节一到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x010032:
    {
        data["describe"] = "关节二到达负软限位";
        data["cause"] = "关节二到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x020032:
    {
        data["describe"] = "关节三到达负软限位";
        data["cause"] = "关节三到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x030032:
    {
        data["describe"] = "关节四到达负软限位";
        data["cause"] = "关节四到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x040032:
    {
        data["describe"] = "关节五到达负软限位";
        data["cause"] = "关节五到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x050032:
    {
        data["describe"] = "关节六到达负软限位";
        data["cause"] = "关节六到达负软限位，机器人运动过程中触发机器人限位。";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x000033:
    {
        data["describe"] = "关节一即将到达正软限位";
        data["cause"] = "关节一到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x010033:
    {
        data["describe"] = "关节二即将到达正软限位";
        data["cause"] = "关节二到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x020033:
    {
        data["describe"] = "关节三即将到达正软限位";
        data["cause"] = "关节三到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x030033:
    {
        data["describe"] = "关节四即将到达正软限位";
        data["cause"] = "关节四到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x040033:
    {
        data["describe"] = "关节五即将到达正软限位";
        data["cause"] = "关节五到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x050033:
    {
        data["describe"] = "关节六即将到达正软限位";
        data["cause"] = "关节六到达正软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x000034:
    {
        data["describe"] = "关节一即将到达负软限位";
        data["cause"] = "关节一到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x010034:
    {
        data["describe"] = "关节二即将到达负软限位";
        data["cause"] = "关节二到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x020034:
    {
        data["describe"] = "关节三即将到达负软限位";
        data["cause"] = "关节三到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x030034:
    {
        data["describe"] = "关节四即将到达负软限位";
        data["cause"] = "关节四到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x040034:
    {
        data["describe"] = "关节五即将到达负软限位";
        data["cause"] = "关节五到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x050034:
    {
        data["describe"] = "关节六即将到达负软限位";
        data["cause"] = "关节六到达负软限位附近,若继续运行机器人,将触发机器人限位";
        data["solution"] = "请检查机器人对应关节角度值，是否已到达限位。如是请修改作业路径。";
        break;
    }
    case 0x0F0033:
    {
        data["describe"] = "到达奇异点";
        data["cause"] = "机器人在运动路径中即将达到奇异构型，无法继续进行笛卡尔空间运动。运动过程中逆解出现异常。在有外部跟踪或补偿时，如柔顺控制或传送带跟踪时，也可能由于外部输入异常导致该报错。";
        data["solution"] = "1）检查当前机器人路径及姿态是否可达，如不可达，更换初始姿态或路径来到达目标位置或者改变目标点的姿态； 2）如果当前处于力控柔顺控制，请检查是否有异常外力以排除影响； 3）如果当前处于传送带跟踪状态，请检查传送带速度、以及编码器反馈是否正常，较大的波动会产生该问题";
        break;
    }
    case 0x0F0034:
    {
        data["describe"] = "检测到碰撞";
        data["cause"] = "检测到碰撞。系统检测到碰撞。";
        data["solution"] = "1）检查机器人周围是否有干涉，是否发生了碰撞； 2）检查机器人序列号、型号是否正确识别； 3）检查机器人负载、安装角度是否正确设置。";
        break;
    }
    case 0x0F0035:
    {
        data["describe"] = "超过姿态限制";
        data["cause"] = "检测到超出姿态限制。机器人末端触发到工具限制。";
        data["solution"] = "请检查当前机器人运动轨迹是否在工具限制设置范围内。或尝试修改工具限制中活动范围大小。";
        break;
    }
    case 0x0F0036:
    {
        data["describe"] = "工具末端超过最大位置偏差限制";
        data["cause"] = "机器人工具末端实际位置与指令位置之间偏差超过设置的偏差限制值；";
        data["solution"] = "请检查机器人运动是否偏离指令位置；";
        break;
    }
    case 0x0F0037:
    {
        data["describe"] = "工具末端线速度超过最大速度限制";
        data["cause"] = "关节运动时机器人末端线速度超过所设置的末端最大线速度限制值；";
        data["solution"] = "请检查APP“安全设置”--“碰撞保护”界面的TCP速度限制是否正确；如TCP速度限制值没有问题请降低关节运动指令速度和加速度；";
        break;
    }
    case 0x000035:
    {
        data["describe"] = "JOG目标位置超过关节一正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x010035:
    {
        data["describe"] = "JOG目标位置超过关节二正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x020035:
    {
        data["describe"] = "JOG目标位置超过关节三正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x030035:
    {
        data["describe"] = "JOG目标位置超过关节四正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x040035:
    {
        data["describe"] = "JOG目标位置超过关节五正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x050035:
    {
        data["describe"] = "JOG目标位置超过关节六正软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x000036:
    {
        data["describe"] = "JOG目标位置超过关节一负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x010036:
    {
        data["describe"] = "JOG目标位置超过关节二负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x020036:
    {
        data["describe"] = "JOG目标位置超过关节三负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x030036:
    {
        data["describe"] = "JOG目标位置超过关节四负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x040036:
    {
        data["describe"] = "JOG目标位置超过关节五负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x050036:
    {
        data["describe"] = "JOG目标位置超过关节六负软限位";
        data["cause"] = "手动控制（JOG）机器人进行运动，当运动的目标点超出机器人关节设置的限位值时，会出现此报警";
        data["solution"] = "1）请检查机器人安全设置中关节限位值是否被修改。 2）请检查目标点是否合理，若不合理，请修改目标点位置。";
        break;
    }
    case 0x000037:
    {
        data["describe"] = "关节一加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节一加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x010037:
    {
        data["describe"] = "关节二加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节二加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x020037:
    {
        data["describe"] = "关节三加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节三加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x030037:
    {
        data["describe"] = "关节四加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节四加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x040037:
    {
        data["describe"] = "关节五加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节五加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x050037:
    {
        data["describe"] = "关节六加速度过大";
        data["cause"] = "手动控制（JOG）机器人进行笛卡尔空间运动时，引起关节六加速度过大。";
        data["solution"] = "1）请使机器人关节运动远离报错位置，再尝试笛卡尔空间JOG。";
        break;
    }
    case 0x0F0049:
    {
        data["describe"] = "仿真模式下无法进入拖拽模式";
        data["cause"] = "仿真模式下无法进入拖拽模式";
        data["solution"] = "检查机器人运行模式，退出仿真后可以进入拖拽模式";
        break;
    }
    case 0x0F0040:
    {
        data["describe"] = "在软限位上无法进入拖拽模式";
        data["cause"] = "在软限位上无法进入拖拽模式";
        data["solution"] = "检查当前机器人关节状态，是否已到达关节限位，若已到达，无法继续运动朝超限方向运动，只能往非超限方向运动，请在示教页面将超限关节jog回关节限位范围内，或在设置页面修改限位。";
        break;
    }
    case 0x0F0041:
    {
        data["describe"] = "拖拽超出软限位 将退出拖拽";
        data["cause"] = "拖拽超出软限位 将退出拖拽。该提示一般在拖拽超过限位。";
        data["solution"] = "检查当前机器人关节状态，机器人无法继续运动朝超限方向运动，只能往非超限方向运动，可以将超限拖拽回关节限位范围内，或这退出拖拽模式，在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x0F0042:
    {
        data["describe"] = "设置柔顺参数失败";
        data["cause"] = "无法在开启力控的条件下设置柔顺参数";
        data["solution"] = "请检查当前是否开启力控。请检查程序中是否使用了柔顺参数设置，保证其执行前力控关闭。";
        break;
    }
    case 0x000042:
    {
        data["describe"] = "关节一即将达到软限位";
        data["cause"] = "关节一即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x010042:
    {
        data["describe"] = "关节二即将达到软限位";
        data["cause"] = "关节二即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x020042:
    {
        data["describe"] = "关节三即将达到软限位";
        data["cause"] = "关节三即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x030042:
    {
        data["describe"] = "关节四即将达到软限位";
        data["cause"] = "关节四即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x040042:
    {
        data["describe"] = "关节五即将达到软限位";
        data["cause"] = "关节五即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x050042:
    {
        data["describe"] = "关节六即将达到软限位";
        data["cause"] = "关节六即将达到软限位";
        data["solution"] = "检查当前机器人关节状态，是否即将到达关节限位，建议往非超限方向运动，请在示教页面将即将超限关节jog回关节限位范围内，或在设置页面修改软限位，增大关节的软限位范围，但软限位的设置范围不能超过硬限位。";
        break;
    }
    case 0x0F0043:
    {
        data["describe"] = "机器人未使能无法进入拖拽";
        data["cause"] = "机器人未使能无法进入拖拽。机器人未使能的状态下检测到拖拽指令触发。";
        data["solution"] = "请检查机器人是否上电上使能；请检查是否是由于外部误触发拖拽按键。";
        break;
    }
    case 0x0F0044:
    {
        data["describe"] = "机器人正在运动无法进入拖拽";
        data["cause"] = "机器人正在运动无法进入拖拽。拖拽模式要求机器人处于手动模式切处于静止的状态下才可切换进去。";
        data["solution"] = "如果机器人正在运行程序，先停止当前的程序，再进入拖拽。如果机器人正在手动运动，请停止后再进行尝试。";
        break;
    }
    case 0x0F0045:
    {
        data["describe"] = "有关节力矩超限无法进入拖拽";
        data["cause"] = "有关节力矩超限无法进入拖拽。一般来说是拖拽速度太快或者碰撞过于灵敏造成的。";
        data["solution"] = "降低拖拽速度或者在设置界面将碰撞等级设置高一些。";
        break;
    }
    case 0x0F0046:
    {
        data["describe"] = "拖拽按钮已屏蔽无法进入拖拽";
        data["cause"] = "机器人末端拖拽按钮（FREE）功能被禁用，无法使用末端按钮（FREE）进行拖拽操作。";
        data["solution"] = "请检查软件硬件与通讯-辅助硬件设置中是否将拖拽功能禁用，若禁用请开启此功能。";
        break;
    }
    case 0x0F0047:
    {
        data["describe"] = "程序暂停/恢复按钮已屏蔽";
        data["cause"] = "机器人末端顶部按钮程序暂停/恢复功能被禁用，无法使用顶部按钮进行程序暂停/恢复操作。";
        data["solution"] = "请检查软件硬件与通讯-辅助硬件设置中是否将程序暂停/恢复功能禁用，若禁用请开启此功能。";
        break;
    }
    case 0x0F0048:
    {
        data["describe"] = "point按钮已屏蔽无法记录点位";
        data["cause"] = "机器人末端点位示教按钮（POINT）功能被禁用，无法使用末端按钮（POINT）进行点位示教操作。";
        data["solution"] = "请检查软件硬件与通讯-辅助硬件设置中是否将点位记录功能禁用，若禁用请开启此功能。";
        break;
    }
    case 0x0F0050:
    {
        data["describe"] = "力矩传感器未就绪 无法使能力控牵引控制";
        data["cause"] = "力矩传感器未就绪 无法使能力控牵引控制。该问题一般出现在开启导纳控制或作业程序柔顺控制时检测到力矩传感器状态未运行。";
        data["solution"] = "请检查是否开启了力矩传感器。";
        break;
    }
    case 0x0F0051:
    {
        data["describe"] = "力控牵引模式下无法切换力矩传感器模式";
        data["cause"] = "在打开力控拖拽之后，无法直接关闭力矩传感器，以免造成非预期结果。";
        data["solution"] = "如需关闭传感器，请先退出力控拖拽，再关闭传感器";
        break;
    }
    case 0x0F0052:
    {
        data["describe"] = "力控牵引过程中力矩传感器故障";
        data["cause"] = "力控牵引过程中力矩传感器故障。可能原因为控制器与外部力矩传感器之间的通讯链路断开。";
        data["solution"] = "请先检查力矩传感器通讯状态是否正常，包括硬件连接线和软件配置。";
        break;
    }
    case 0x0F0054:
    {
        data["code"] = 3;
        data["describe"] = "程序运行期间无法执行单步运行操作";
        data["cause"] = "程序运行期间无法执行单步运行操作";
        data["solution"] = "如果您要使用单步调试功能，可以先停止运行当前程序，再进行单步调试。";
        break;
    }
    case 0x0F0055:
    {
        data["code"] = 3;
        data["describe"] = "拖拽期间不能设置碰撞灵敏度";
        data["cause"] = "拖拽期间不能设置碰撞灵敏度";
        data["solution"] = "先退出拖拽模式，再设置灵敏度。";
        break;
    }
    case 0x0F0056:
    {
        data["describe"] = "扩展IO模块未运行 无法访问";
        data["cause"] = "扩展IO模块未运行 无法访问";
        data["solution"] = "在IO监控界面检查扩展IO模块是否处于运行状态。";
        break;
    }
    case 0x0F0057:
    {
        data["code"] = 3;
        data["describe"] = "机器人运动时无法使能或关闭动力学前馈";
        data["cause"] = "机器人运动时无法使能或关闭动力学前馈，此错误只有在使用二次开发接口的时候才会出现。";
        data["solution"] = "先停止当前机器人的运动，再设置机器人的动力学前馈。";
        break;
    }
    case 0x0F0058:
    {
        data["code"] = 2;
        data["describe"] = "未检测到功能使用许可";
        data["cause"] = "未检测到功能使用许可。部分功能的启用需要软件授权，若功能使用过程中检测到软件未授权，则提示该错误。";
        data["solution"] = "联系JAKA工作人员购买功能使用许可。";
        break;
    }
    case 0x0F0059:
    {
        data["code"] = 3;
        data["describe"] = "保护性停止复位失败";
        data["cause"] = "保护性停止复位失败。该错误一般在进行保护性停止复位操作时检测到保护性停止的功能输入仍然处于触发状态。";
        data["solution"] = "请查看功能IO是否触发了保护性停止，如是请先退出保护性停止模式再进行保护性停止复位操作。";
        break;
    }
    case 0x0F0060:
    {
        data["code"] = 3;
        data["describe"] = "保护性停止模式下无法设置倍率";
        data["cause"] = "保护性停止模式下无法设置倍率。";
        data["solution"] = "先退出保护性停止模式，再设置机器人的速度倍率。";
        break;
    }
    case 0x0F0061:
    {
        data["code"] = 2;
        data["describe"] = "用户坐标系标定失败";
        data["cause"] = "选择的标定点位不合适导致用户坐标系标定失败。";
        data["solution"] = "请重新设置合适的示教点位。";
        break;
    }
    case 0x000061:
    {
        data["code"] = 3;
        data["describe"] = "关节一检测到碰撞并停止运动";
        data["cause"] = "关节一检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x010061:
    {
        data["code"] = 3;
        data["describe"] = "关节二检测到碰撞并停止运动";
        data["cause"] = "关节二检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x020061:
    {
        data["code"] = 3;
        data["describe"] = "关节三检测到碰撞并停止运动";
        data["cause"] = "关节三检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x030061:
    {
        data["code"] = 3;
        data["describe"] = "关节四检测到碰撞并停止运动";
        data["cause"] = "关节四检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x040061:
    {
        data["code"] = 3;
        data["describe"] = "关节五检测到碰撞并停止运动";
        data["cause"] = "关节五检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x050061:
    {
        data["code"] = 3;
        data["describe"] = "关节六检测到碰撞并停止运动";
        data["cause"] = "关节六检测到碰撞并停止运动";
        data["solution"] = "1）检查现场环境，确实是否发生了真实的碰撞。如是，请优化作业程序； 2）如果发生误报碰撞，请检查负载、安装角度是否设置正确； 3）手动控制报错关节运动检查对应关节是否存在内部卡塞。";
        break;
    }
    case 0x0F0062:
    {
        data["code"] = 3;
        data["describe"] = "TIO RS485通道力矩传感器模式未启用";
        data["cause"] = "TIO RS485通道力矩传感器模式未启用。启用TIO+力矩传感器时检测到引脚复用配置异常。";
        data["solution"] = "当力矩传感器设置中选择传感器类型VI时，此时启用力矩传感器会检测TIO是否有通道被正确设置为力矩传感器模式。如未正确设置则错上述信息，请检查相关配置。";
        break;
    }
    case 0x0F0063:
    {
        data["code"] = 3;
        data["describe"] = "最多支持一路TIO RS485通道启用为力矩传感器模式";
        data["cause"] = "最多支持一路TIO RS485通道启用为力矩传感器模式。由于CAN通道带宽限制，TIO+两路RS485最多仅有1路可以被用作力矩传感器。";
        data["solution"] = "请对力矩传感器修改通道配置，将当前被设置为力矩传感器模式的RS485通道进行模式变更后再进行操作。";
        break;
    }
    case 0x0F0064:
    {
        data["code"] = 2;
        data["describe"] = "通讯参数修改失败 使用此通道的力矩传感器正在运行";
        data["cause"] = "修改TIO RS485通讯参数修改失败 使用此通道的力矩传感器正在运行。";
        data["solution"] = "力矩传感器运行时禁止修改其通讯参数。请先停止运行，再进行通讯参数修改操作。";
        break;
    }
    case 0x0F0065:
    {
        data["code"] = 2;
        data["describe"] = "信号量定义无效";
        data["cause"] = "信号量定义无效。末端Modbus夹爪的状态通过信号量机制进行查询，信号量的定义需满足一定的规范，包括名称、功能码、地址等。不满足定义规范时会提示该错误。";
        data["solution"] = "请检查当前TIO RS485通道ID是否正确，指定通道模式设置是否为Modbus RTU，功能码是否支持（目前仅支持功能码01，02，03，04）。";
        break;
    }
    case 0x0F0066:
    {
        data["code"] = 2;
        data["describe"] = "信号量超过最大支持数量（8个）";
        data["cause"] = "受限于带宽，信号量的支持数量存在限制，最大支持8个，超出该数量会报错。";
        data["solution"] = "目前最多支持定义8个信号量，请删除不必要的信号量定义。";
        break;
    }
    case 0x0F0067:
    {
        data["code"] = 3;
        data["describe"] = "指定信号量不存在";
        data["cause"] = "指定信号量不存在。该错误一般在作业程序中引用了不存在的信号量。";
        data["solution"] = "请检查信号量相关的程序调用以及信号量定义，是否有引用未定义的信号量。";
        break;
    }
    case 0x0F0068:
    {
        data["code"] = 3;
        data["describe"] = "发送TIO RS485指令失败 指令队列已满";
        data["cause"] = "指令队列已满， 发送TIO RS485指令失败。该问题一般出现在高频率的调用信号量刷新或者指令发送。";
        data["solution"] = "受限于CAN通讯带宽，TIO+相关的查询与设置指令均会进行缓冲。如应用层刷新速率高于该带宽，则会提示该信息。请降低作业程序或应用端的指令调用频率。";
        break;
    }
    case 0x0F0069:
    {
        data["code"] = 2;
        data["describe"] = "接收TIO RS485指令反馈超时";
        data["cause"] = "接收TIO RS485指令反馈超时。该问题一般出现在控制器发出RS 485指令后等待反馈超时。";
        data["solution"] = "请检查TIO+相关通讯设置是否正确；检查控制器与机器人之间通讯链路是否正常。";
        break;
    }
    case 0x0F0070:
    {
        data["code"] = 3;
        data["describe"] = "本体DH参数读取校验异常";
        data["cause"] = "上电时读取伺服端DH参数CRC错误";
        data["solution"] = "请重新上电，若无法解决或经常出现请升级伺服";
        break;
    }
    case 0x0F0071:
    {
        data["code"] = 3;
        data["describe"] = "动力学参数读取校验异常";
        data["cause"] = "上电时读取伺服端动力学参数CRC错误";
        data["solution"] = "请重新上电，若无法解决或经常出现请升级伺服";
        break;
    }
    case 0x0F0072:
    {
        data["code"] = 3;
        data["describe"] = "正在从伺服读取D-H或动力学参数 无法使能机器人";
        data["cause"] = "正在从伺服读取 D-H或动力学参数 无法使能机器人。在机器人打开电源后立即上使能时，未读取到DH参数并报错。";
        data["solution"] = "打开电源后控制器会从伺服读取DH参数，期间禁止使能机器人。如等待后使能时依然出现，请检查控制器与机器人之间的通讯链路。如故障现象持续，联系JAKA技术人员。";
        break;
    }
    case 0x0F0073:
    {
        data["code"] = 3;
        data["describe"] = "达到机器人动量限制";
        data["cause"] = "达到机器人动量限制。机器人安全界面可以设置机器人动量限制，达到该限制时会触发报警。";
        data["solution"] = "此错误为警告无需处理，当机器人动量的绝对值大于用户的设定阈值，机器人会自动进行倍率减速。";
        break;
    }
    case 0x0F0074:
    {
        data["code"] = 2;
        data["describe"] = "达到机器人TCP速度限制";
        data["cause"] = "达到机器人TCP速度限制。机器人安全界面可以设置机器人TCP速度限制，达到该限制时会触发报警。";
        data["solution"] = "此为通知性质的弹窗警告，可忽略，可以检查一下是否在安全设置界面下的碰撞保护当中进行了TCP速度限制。";
        break;
    }
    case 0x0F0075:
    {
        data["code"] = 3;
        data["describe"] = "即将超出安全平面";
        data["cause"] = "即将超出安全平面，机器人只能在设置的安全平面范围内工作。";
        data["solution"] = "请确认安全平面设置是否符合实际；排查时可关闭安全平面功能或者控制器机器人朝安全平面内运动。";
        break;
    }
    case 0x0F0076:
    {
        data["code"] = 2;
        data["describe"] = "伺服端DH参数版本号无效";
        data["cause"] = "机器人运动学参数版本与控制器不兼容";
        data["solution"] = "请升级伺服或降级控制器";
        break;
    }
    case 0x0F0077:
    {
        data["code"] = 2;
        data["describe"] = "伺服端动力学参数版本号无效";
        data["cause"] = "机器人动力学参数版本与控制器不兼容";
        data["solution"] = "请升级伺服或降级控制器";
        break;
    }
    case 0x0F0078:
    {
        data["code"] = 2;
        data["describe"] = "伺服使能操作过于频繁";
        data["cause"] = "App主界面本体上使能按钮连续点击";
        data["solution"] = "App主界面本体上使能按钮按下后，1秒后观察本体末端呼吸灯是否由蓝色转变成绿色，正常为由蓝色变绿色，并伴随关节“啪啪”释放刹车声音";
        break;
    }
    case 0x0F0079:
    {
        data["code"] = 3;
        data["describe"] = "无法切换仿真/真机模式 请关闭电源";
        data["cause"] = "当机器人处于上电上使能状态时，使用APP切换机器人仿真/真机模式功能，提示报错";
        data["solution"] = "请将机器人处于下电下使能状态下后，进行修改仿真/真机模式切换功能。";
        break;
    }
    case 0x0F007A:
    {
        data["code"] = 3;
        data["describe"] = "不支持将两个网口的IP设置在同一网段";
        data["cause"] = "App设置界面网络配置界面IP地址设置到了10.5.5.X网络段，与控制器自带网络IP地址网段冲突";
        data["solution"] = "App设置界面网络配置界面IP设置不允许在10.5.5.X网络IP段。修改的为标准控制器的底部网口和MinCab的LAN2口IP地址，修改后为静态IP地址：网络配置参考设置格式：IP：192.168.10.120 子掩码：255.255.255.0 默认网关：192.168.10.1";
        break;
    }
    case 0x0F007B:
    {
        data["code"] = 3;
        data["describe"] = "即将超出姿态安全限制";
        data["cause"] = "机器人即将到达奇异点姿态附近，或即将超出最大工作半径";
        data["solution"] = "控制机器人运动时，请避开奇异点姿态，并使机器人在其最大工作半径范围内移动。";
        break;
    }
    case 0x0F007C:
    {
        data["code"] = 3;
        data["describe"] = "无法切换仿真/真机模式";
        data["cause"] = "虚拟机不支持此功能";
        data["solution"] = "虚拟机不支持此功能";
        break;
    }
    case 0x0F0080:
    {
        data["code"] = 3;
        data["describe"] = "上电状态不允许切换机器人模型";
        data["cause"] = "当机器人处于上电状态时，使用APP机器人仿真/真机模式功能进行切换机器人型号模型，提示报错";
        data["solution"] = "请将机器人处于下电下使能状态下后，进行仿真/真机模式功能机型切换操作。";
        break;
    }
    case 0x0F0081:
    {
        data["code"] = 3;
        data["describe"] = "机器人运动过程中不允许重置密码";
        data["cause"] = "当机器人处于程序运行状态下，进行用户权限密码修改操作，提示报错";
        data["solution"] = "请将机器人程序运动状态处于停止状态，再尝试进行用户权限密码修改操作。";
        break;
    }
    case 0x0F0082:
    {
        data["code"] = 3;
        data["describe"] = "请检查密码复位按钮是否正常";
        data["cause"] = "密码复位按钮功能异常。";
        data["solution"] = "请检查密码复位按钮是否正常，或联系技术服务人员。";
        break;
    }
    case 0x0F0083:
    {
        data["code"] = 2;
        data["describe"] = "关节减速失败";
        data["cause"] = "无法自动纠正当前运动的关节速度低于限制速度";
        data["solution"] = "请提高安全设置中的限制速度或降低指令速度";
        break;
    }
    case 0x0F0084:
    {
        data["code"] = 2;
        data["describe"] = "圆形传送带P1、P2、P3 三点共线";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F0085:
    {
        data["code"] = 2;
        data["describe"] = "直线传送带跟踪方向为零";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F0086:
    {
        data["code"] = 2;
        data["describe"] = "获取辨识结果失败";
        data["cause"] = "辨识过程文件可能丢失，请重试";
        data["solution"] = "";
        break;
    }
    case 0x0F0087:
    {
        data["code"] = 2;
        data["describe"] = "时间最优规划寻优失败";
        data["cause"] = "使用时间最优进行规划时无法找到最优解";
        data["solution"] = "请降低指令速度后再次尝试或使用其他规划器进行运动规划";
        break;
    }
    case 0x0F0100:
    {
        data["code"] = 2;
        data["describe"] = "机器人功率超限";
        data["cause"] = "App碰撞设置界面功率设置小于机器人运动需求功率";
        data["solution"] = "App碰撞设置界面功率增大功率设置值，JAKA机型负载3KG参考值1000，负载5KG\7KG参考值1500，负载12KG参考值2000，负载18KG参考值2000";
        break;
    }
    case 0x0F0101:
    {
        data["code"] = 2;
        data["describe"] = "机器人动量超限";
        data["cause"] = "App碰撞设置界面动量设置小于机器人运动需求动量";
        data["solution"] = "App碰撞设置界面增大动量设置值，JAKA机型负载3KG参考值5，负载5KG\7KG参考值10，负载12KG参考值30，负载18KG参考值50";
        break;
    }
    case 0x0F0102:
    {
        data["code"] = 2;
        data["describe"] = "底座传感器检测到碰撞";
        data["cause"] = "SP型号机器人，当机器人处于上使能状态时，底座传感器信号异常增大，超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0103:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，1轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0104:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，2轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0105:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，3轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0106:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，4轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0107:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，5轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0108:
    {
        data["code"] = 2;
        data["describe"] = "末端力超限，6轴检测到碰撞";
        data["cause"] = "当机器人处于程序运行状态中，关节电流突然增大超出设定阈值，提示报警。";
        data["solution"] = "1.查看机器是否碰撞到外围设备。 2.查看机器人在运动过程中是否受到线缆拉扯。 3.适当降低机器人的加速度 4.核验机器人末端负载是否正确 5.可尝试增大机器人碰撞等级";
        break;
    }
    case 0x0F0109:
    {
        data["code"] = 2;
        data["describe"] = "安全平面设置点不允许共线或重合";
        data["cause"] = "安全平面设置需要有三个面点和一个安全点，这三个点都是笛卡尔坐标，当三个面点重合或者共线则报错，当安全点在安全面上则报错";
        data["solution"] = "请检查安全面点是否重合或者共线，检查安全点是否在安全平面上。";
        break;
    }
    case 0x0F0110:
    {
        data["code"] = 2;
        data["describe"] = "设置动力学参数必须打开电源并处于下使能状态";
        data["cause"] = "机器人未下使能，或者未上电";
        data["solution"] = "请检查机器人状态，打开机器人电源并关闭机器人使能";
        break;
    }
    case 0x0F0111:
    {
        data["code"] = 2;
        data["describe"] = "在设置动力学参数的过程中，参数设置意外中断";
        data["cause"] = "在设置动力学参数过程中，机器人与电控柜之间CAN通讯存在异常";
        data["solution"] = "1.请尝试将机器人下电下使能后，重新再次上电。2.请检查机器人与电控柜之间重载连接线是否存在连接异常问题";
        break;
    }
    case 0x0F0112:
    {
        data["code"] = 2;
        data["describe"] = "在设置动力学参数的过程中，参数设置超时";
        data["cause"] = "在设置动力学参数过程中，机器人与电控柜之间CAN通讯存在异常";
        data["solution"] = "1.请尝试将机器人下电下使能后，重新再次上电。2.请检查机器人与电控柜之间重载连接线是否存在连接异常问题";
        break;
    }
    case 0x0F0113:
    {
        data["code"] = 3;
        data["describe"] = "本版本不再支持当前控制柜";
        data["cause"] = "v1.7.1之后的控制器软件将不再支持";
        data["solution"] = "若确认要使用请更新到对应版本，如v1.5";
        break;
    }
    case 0x0F0114:
    {
        data["code"] = 3;
        data["describe"] = "无法在下使能状态下进行辨识";
        data["cause"] = "无法在下使能状态下进行辨识";
        data["solution"] = "请先上使能再进行辨识";
        break;
    }
    case 0x0F0115:
    {
        data["code"] = 2;
        data["describe"] = "获取底部网口ip失败";
        data["cause"] = "获取底部网口ip失败";
        data["solution"] = "请检查底部网口连接状态，虚拟机获取ip失败，暂时无法从虚拟机获取\\设置ip";
        break;
    }
    case 0x0F0140:
    {
        data["code"] = 2;
        data["describe"] = "超出设定力值软限位";
        data["cause"] = "超出设定力值软限位";
        data["solution"] = "请确认机器人末端是否与外部发生撞击.";
        break;
    }
    case 0x0F0141:
    {
        data["code"] = 2;
        data["describe"] = "超过传感器最大量程";
        data["cause"] = "超过传感器最大量程";
        data["solution"] = "请确认机器人末端是否与外部发生撞击；传感器在发生猛烈撞击后可能发生不可逆损坏.";
        break;
    }
    case 0x0F0116:
    case 0x0F0117:
    case 0x0F0118:
    case 0x0F0119:
    case 0x0F011A:
    case 0x0F011B:
    case 0x0F011C:
    case 0x0F011D:
    case 0x0F011E:
    case 0x0F011F:
    case 0x0F0120:
    case 0x0F0121:
    case 0x0F0122:
    case 0x0F0123:
    case 0x0F0124:
    case 0x0F0125:
    case 0x0F0126:
    case 0x0F0127:
    case 0x0F0128:
    case 0x0F0129:
    case 0x0F012A:
    case 0x0F012B:
    case 0x0F012C:
    case 0x0F012D:
    case 0x0F012E:
    case 0x0F012F:
    case 0x0F0130:
    case 0x0F0131:
    case 0x0F0132:
    case 0x0F0133:
    {
        data["code"] = 2;
        data["describe"] = "AddOnError";
        data["cause"] = "";
        data["solution"] = "请联系开发人员";
        break;
    }
    case 0x0F0134:
    {
        data["code"] = 3;
        data["describe"] = "分享程序成功";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F0135:
    {
        data["code"] = 3;
        data["describe"] = "分享程序失败";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F1001:
    {
        data["code"] = 3;
        data["describe"] = "使能超时 请重新打开电源";
        data["cause"] = "当机器人处于上使能过程中，关节电磁铁出现未吸合情况，提示报错";
        data["solution"] = "请尝试将机器人下电，重新进行上电上使能操作。 2.请检查机器人关节电磁铁是否存在异常，或联系技术人员";
        break;
    }
    case 0x0F1002:
    {
        data["code"] = 3;
        data["describe"] = "伺服版本号查询超时";
        data["cause"] = "当机器人与电控柜之间CAN通讯存在异常时，提示报错";
        data["solution"] = "1.请尝试将机器人下电下使能后，重新再次上电上使能。 2.请检查机器人与电控柜之间重载连接线是否存在连接异常问题。";
        break;
    }
    case 0x001002:
    case 0x011002:
    case 0x021002:
    case 0x031002:
    case 0x041002:
    case 0x051002:
    {
        data["code"] = 2;
        data["describe"] = "关节CAN连接异常";
        data["cause"] = "关节CAN总线异常导致数据获取失败或超时导致报错提示";
        data["solution"] = "1.将机器人下电下使能，打开报错关节闷盖，检查关节内部CAN线是否存在异常。 2.请联系技术人员咨询。";
        break;
    }
    case 0x001003:
    case 0x011003:
    case 0x021003:
    case 0x031003:
    case 0x041003:
    case 0x051003:
    {
        data["code"] = 2;
        data["describe"] = "关节驱动器故障";
        data["cause"] = "本体上电后，关节驱动板无信号返回控制器";
        data["solution"] = "App监控界面查看关节一的监控电压、电流、温度是否存在数据显示，当本体上电正常时存在数值显示情况，若无数值显示请联系技术人员协助处理。";
        break;
    }
    case 0x001004:
    case 0x011004:
    case 0x021004:
    case 0x031004:
    case 0x041004:
    case 0x051004:
    {
        data["code"] = 2;
        data["describe"] = "关节跟随误差过大";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F2000:
    case 0x0F2001:
    case 0x0F2002:
    case 0x0F2003:
    case 0x0F2010:
    case 0x0F2014:
    case 0x0F201C:
    case 0x0F201D:
    case 0x0F201E:
    case 0x0F201F:
    case 0x0F2020:
    case 0x0F2021:
    case 0x0F2022:
    case 0x0F2023:
    case 0x0F2025:
    case 0x0F2026:
    case 0x0F2027:
    case 0x0F2028:
    case 0x0F2029:
    case 0x0F202A:
    case 0x0F202B:
    case 0x0F202C:
    case 0x0F202D:
    case 0x0F202E:
    case 0x0F202F:
    case 0x0F2030:
    case 0x0F2031:
    case 0x0F2032:
    case 0x0F2033:
    case 0x0F2034:
    case 0x0F2035:
    case 0x0F2036:
    case 0x0F2037:
    case 0x0F2038:
    case 0x0F2039:
    case 0x0F203A:
    case 0x0F203B:
    case 0x0F203C:
    case 0x0F203D:
    case 0x0F203E:
    case 0x0F203F:
    case 0x0F2040:
    case 0x0F2041:
    case 0x0F2042:
    case 0x0F2043:
    case 0x0F2050:
    case 0x0F2051:
    case 0x0F2052:
    case 0x0F2053:
    case 0x0F2054:
    case 0x0F2055:
    case 0x0F2056:
    case 0x0F2057:
    case 0x0F2058:
    case 0x0F2059:
    case 0x0F2060:
    case 0x0F2061:
    case 0x0F201B:
    {
        data["code"] = 2;
        data["describe"] = "编程文件导致错误";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F2011:
    {
        data["code"] = 2;
        data["describe"] = "Python脚本错误";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F2012:
    {
        data["code"] = 2;
        data["describe"] = "解析断言失败";
        data["cause"] = "运动参数设置不合理。 出错的文件为： 错误行号是：";
        data["solution"] = "检查运动参数设置";
        break;
    }
    case 0x0F2013:
    {
        data["code"] = 2;
        data["describe"] = "解析失败，圆弧半径为零";
        data["cause"] = "圆弧运动点位设置存在异常，机器人运动轨迹规划失败。 出错的文件为： 错误行号是：";
        data["solution"] = "请检查圆弧运动中机器人点位设置是否存在异常，请重新配置圆弧运动点位信息";
        break;
    }
    case 0x0F2015:
    case 0x0F2016:
    case 0x0F2017:
    case 0x0F2018:
    case 0x0F2019:
    case 0x0F2024:
    case 0x0F2062:
    case 0x0F2063:
    case 0x0F2064:
    case 0x0F2065:
    case 0x0F2066:
    case 0x0F2067:
    {
        data["code"] = 2;
        data["describe"] = "SOCKET 错误";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F201A:
    {
        data["code"] = 2;
        data["describe"] = "加载2D视觉配置失败";
        data["cause"] = "废弃";
        data["solution"] = "请检查控制器是否为调试版本，或联系技术服务人员提供相关错误码描述信息。";
        break;
    }
    case 0x0F3001:
    case 0x0F3002:
    {
        data["code"] = 2;
        data["describe"] = "控制器连接的视觉设备出错";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F4001:
    {
        data["code"] = 2;
        data["describe"] = "伺服状态读取失败";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F4002:
    {
        data["code"] = 2;
        data["describe"] = "固件升级失败";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F4003:
    {
        data["code"] = 2;
        data["describe"] = "当前硬件不支持该功能";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    case 0x0F4004:
    {
        data["code"] = 2;
        data["describe"] = "机器人关节存在潜在风险";
        data["cause"] = "关节内部参数自检异常。注：此信息为警告信息，对程序运行无影响。";
        data["solution"] = "请联系技术支持工程师对关节进行点检排查。";
        break;
    }
    case 0x102230:
    case 0x112230:
    case 0x122230:
    case 0x132230:
    case 0x142230:
    case 0x152230:
    {
        data["code"] = 2;
        data["describe"] = "关节母线过流";
        data["cause"] = "电机反馈电流超出阈值";
        data["solution"] = "请将使用异常报错的功能和当前使用的控制器版本信息一并拍照，并将该故障的诊断日志保存后联系技术支持工程师处理。";
        break;
    }
    case 0x102320:
    case 0x112320:
    case 0x122320:
    case 0x132320:
    case 0x142320:
    case 0x152320:
    {
        data["code"] = 2;
        data["describe"] = "关节输出过流";
        data["cause"] = "检测到电机UVW的电流，超出硬件驱动板的过流阈值";
        data["solution"] = "1.请降低机器人负载，进行使用;2.请降低机器人运动速度或加速度。进行使用;3.机器人关节驱动板或减速机异常，请联系技术支持人员;4.通讯异常：请更换重载连接线或电控柜，或联系技术支持人员";
        break;
    }
    case 0x102321:
    case 0x112321:
    case 0x122321:
    case 0x132321:
    case 0x142321:
    case 0x152321:
    {
        data["code"] = 2;
        data["describe"] = "关节自学习过流";
        data["cause"] = "关节上使能过程中，输出较大的电流，但未检测电机转动";
        data["solution"] = "1.请将机器人下使能，手动释放关节电磁铁，检查是否可推动报警的关节;2.请将机器人本体断电后，拆开后盖，检测线缆是否接触异常，或联系技术支持人员.";
        break;
    }
    case 0x108480:
    case 0x118480:
    case 0x128480:
    case 0x138480:
    case 0x148480:
    case 0x158480:
    {
        data["code"] = 2;
        data["describe"] = "关节正向速度跟踪错误";
        data["cause"] = "实际转速与设定转速同向时，转速误差超过设定的报警阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确.";
        break;
    }
    case 0x108481:
    case 0x118481:
    case 0x128481:
    case 0x138481:
    case 0x148481:
    case 0x158481:
    {
        data["code"] = 2;
        data["describe"] = "关节负向速度跟踪错误";
        data["cause"] = "实际转速与设定转速反向时，转速误差超过设定的报警阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确.";
        break;
    }
    case 0x108482:
    case 0x118482:
    case 0x128482:
    case 0x138482:
    case 0x148482:
    case 0x158482:
    {
        data["code"] = 2;
        data["describe"] = "关节速度超限";
        data["cause"] = "关节实际转速超出关节额定速度";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108483:
    case 0x118483:
    case 0x128483:
    case 0x138483:
    case 0x148483:
    case 0x158483:
    {
        data["code"] = 2;
        data["describe"] = "关节速度跟踪误差过大";
        data["cause"] = "关节实际转速与指令转速偏差超出报警阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108484:
    case 0x118484:
    case 0x128484:
    case 0x138484:
    case 0x148484:
    case 0x158484:
    {
        data["code"] = 2;
        data["describe"] = "关节加速度超差";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息.";
        break;
    }
    case 0x108485:
    case 0x118485:
    case 0x128485:
    case 0x138485:
    case 0x148485:
    case 0x158485:
    {
        data["code"] = 2;
        data["describe"] = "关节速度控制异常";
        data["cause"] = "关节实际转速与指令转速偏差超出阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x107380:
    case 0x117380:
    case 0x127380:
    case 0x137380:
    case 0x147380:
    case 0x157380:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器连接超时";
        data["cause"] = "绝对编码器的读状态出错";
        data["solution"] = "1.请联系技术人员检查报警关节的生产参数是否正确;2.请联系技术人员，更换编码器连接排线，查看故障是否消除;3.请联系技术人员，检查编码器状态灯是否异常;";
        break;
    }
    case 0x107381:
    case 0x117381:
    case 0x127381:
    case 0x137381:
    case 0x147381:
    case 0x157381:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器电池欠压";
        data["cause"] = "编码器内部电池欠压";
        data["solution"] = "1.生产参数确认：联系技术人员检查报警关节的生产参数是否正确;2.检查排线：拆开关节端盖，检查编码器排线是否松动，联系技术人员更换;3.编码器故障，更换关节编码器或更换关节;";
        break;
    }
    case 0x107382:
    case 0x117382:
    case 0x127382:
    case 0x137382:
    case 0x147382:
    case 0x157382:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器电池断开";
        data["cause"] = "编码器电源错误";
        data["solution"] = "1.如报错仅出现在机器人上电、下电过程中，不影响使用，无需进一步处理;2.编码器损坏，如故障持续出现影响使用，联系技术人员更换;";
        break;
    }
    case 0x107383:
    case 0x117383:
    case 0x127383:
    case 0x137383:
    case 0x147383:
    case 0x157383:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器存储角度错误";
        data["cause"] = "关节电机位置校准出错";
        data["solution"] = "1.请联系技术人员检查报警关节的生产参数是否正确;2.请联系技术人员对关节进行重新标定Z值;";
        break;
    }
    case 0x107384:
    case 0x117384:
    case 0x127384:
    case 0x137384:
    case 0x147384:
    case 0x157384:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器计数错误";
        data["cause"] = "相对编码器计数异常";
        data["solution"] = "1.请联系技术人员检查报警关节的生产参数是否正确;2.请联系技术人员检查编码器安装或查看码盘脏污情况;";
        break;
    }
    case 0x107385:
    case 0x117385:
    case 0x127385:
    case 0x137385:
    case 0x147385:
    case 0x157385:
    {
        data["code"] = 2;
        data["describe"] = "关节双编码器校验错误";
        data["cause"] = "关节双编码器记录的位置出现偏差，超出一定的阈值";
        data["solution"] = "1.请联系技术人员检查报警关节的生产参数是否正确;2.请确认是否发生严重碰撞或机械失效，并联系技术人员;3.请联系技术人员检查编码器安装或查看码盘脏污情况;";
        break;
    }
    case 0x107387:
    case 0x117387:
    case 0x127387:
    case 0x137387:
    case 0x147387:
    case 0x157387:
    {
        data["code"] = 2;
        data["describe"] = "关节Z线捕捉故障";
        data["cause"] = "相对编码器Z线捕捉异常";
        data["solution"] = "1.请联系技术人员检查报警关节的生产参数是否正确;2.请联系技术人员对关节相对编码器进行查看修复;";
        break;
    }
    case 0x108611:
    case 0x118611:
    case 0x128611:
    case 0x138611:
    case 0x148611:
    case 0x158611:
    {
        data["code"] = 2;
        data["describe"] = "关节位置偏差过大";
        data["cause"] = "实际位置反馈与指令位置偏差超出设定阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108612:
    case 0x118612:
    case 0x128612:
    case 0x138612:
    case 0x148612:
    case 0x158612:
    {
        data["code"] = 2;
        data["describe"] = "关节位置指令增量过大";
        data["cause"] = "位置指令增量过大，超过阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108613:
    case 0x118613:
    case 0x128613:
    case 0x138613:
    case 0x148613:
    case 0x158613:
    {
        data["code"] = 2;
        data["describe"] = "关节加速度过大";
        data["cause"] = "位置指令加速度过大，超过阈值";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108614:
    case 0x118614:
    case 0x128614:
    case 0x138614:
    case 0x148614:
    case 0x158614:
    {
        data["code"] = 2;
        data["describe"] = "关节位置指令过大";
        data["cause"] = "控制器下发的位置指令出错";
        data["solution"] = "1.请检查程序加速度是否设置过大;2.请检查运动段转接参数设置是否存在异常;3.请检查是否出现碰撞，负载设置是否正确;4.若当时使用为servo模式，请检查发送指令是否连续或异常，位置逆解是否连续或异常;";
        break;
    }
    case 0x108615:
    case 0x118615:
    case 0x128615:
    case 0x138615:
    case 0x148615:
    case 0x158615:
    {
        data["code"] = 2;
        data["describe"] = "关节CAN通讯异常";
        data["cause"] = "机器人总线通讯异常";
        data["solution"] = "请联系技术人员检查机器人总线通讯是否异常";
        break;
    }
    case 0x103220:
    case 0x113220:
    case 0x123220:
    case 0x133220:
    case 0x143220:
    case 0x153220:
    {
        data["code"] = 2;
        data["describe"] = "关节伺服欠压";
        data["cause"] = "检测到母线电压，超出硬件驱动板的欠压阈值";
        data["solution"] = "1.请检查机器人负载或运动加速度是否设置过大，请尝试降低运行工况使用;2.请尝试检查机器人重载线是否连接异常;3.请联系技术人员，协助检查驱动板硬件是否异常;4.请联系技术人员，协助检查通讯或电控柜电源是否异常";
        break;
    }
    case 0x103210:
    case 0x113210:
    case 0x123210:
    case 0x133210:
    case 0x143210:
    case 0x153210:
    {
        data["code"] = 2;
        data["describe"] = "关节伺服过压";
        data["cause"] = "检测到母线电压，超出硬件驱动板的过压阈值";
        data["solution"] = "1.请检查机器人负载或运动加速度是否设置过大，请尝试降低运行工况使用;2.请尝试检查电控柜泄放板是否异常;3.请联系技术人员，协助检查驱动板硬件是否异常;";
        break;
    }
    case 0x104310:
    case 0x114310:
    case 0x124310:
    case 0x134310:
    case 0x144310:
    case 0x154310:
    {
        data["code"] = 2;
        data["describe"] = "关节伺服过温";
        data["cause"] = "检测到驱动板上的温度，超出硬件驱动板的过温阈值";
        data["solution"] = "1.请检查当前机器人使用环境温度是否超出机器人使用温度范围;2.请检查关节外表面温度是否大于50℃，若大于50℃，请降低使用工况;3.请联系技术人员进行检查关节驱动板或关节减速机是否存在异常;";
        break;
    }
    case 0x102350:
    case 0x112350:
    case 0x122350:
    case 0x132350:
    case 0x142350:
    case 0x152350:
    {
        data["code"] = 2;
        data["describe"] = "关节模块过载（I2T）";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x105480:
    case 0x115480:
    case 0x125480:
    case 0x135480:
    case 0x145480:
    case 0x155480:
    {
        data["code"] = 2;
        data["describe"] = "关节伺服过功率";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x103380:
    case 0x113380:
    case 0x123380:
    case 0x133380:
    case 0x143380:
    case 0x153380:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器校零失败";
        data["cause"] = "关节上使能的过程中，电机转动与预期的不一致";
        data["solution"] = "1.联系技术人员，检查报警关节的相关参数是否存在异常;2.请尝试对关节进行上下使能操作，检查制动器是否异常;3.请联系技术人员，检查关节ABZ接线或ABZ码盘是否存在异常";
        break;
    }
    case 0x103381:
    case 0x113381:
    case 0x123381:
    case 0x133381:
    case 0x143381:
    case 0x153381:
    {
        data["code"] = 2;
        data["describe"] = "关节输出缺相";
        data["cause"] = "上使能过程中，三相电流输出异常";
        data["solution"] = "1.请联系技术人员检查关节三相接线是否存在异常;2.请联系技术人员检查关节电机线路是否存在异常;3.请联系技术人员检查关节驱动板是否存在异常";
        break;
    }
    case 0x103130:
    case 0x113130:
    case 0x123130:
    case 0x133130:
    case 0x143130:
    case 0x153130:
    {
        data["code"] = 2;
        data["describe"] = "关节输入缺相";
        data["cause"] = "上使能过程中，三相电流输出异常";
        data["solution"] = "1.请联系技术人员检查关节三相接线是否存在异常;2.请联系技术人员检查关节电机线路是否存在异常;3.请联系技术人员检查关节驱动板是否存在异常";
        break;
    }
    case 0x105441:
    case 0x115441:
    case 0x125441:
    case 0x135441:
    case 0x145441:
    case 0x155441:
    {
        data["code"] = 2;
        data["describe"] = "关节内部连接错误";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x105280:
    case 0x115280:
    case 0x125280:
    case 0x135280:
    case 0x145280:
    case 0x155280:
    {
        data["code"] = 2;
        data["describe"] = "关节内部参数错误";
        data["cause"] = "伺服参数超出阈值，该故障只有上电时会报";
        data["solution"] = "请联系技术人员进行检查关节内部参数是否存在异常";
        break;
    }
    case 0x105281:
    case 0x115281:
    case 0x125281:
    case 0x135281:
    case 0x145281:
    case 0x155281:
    {
        data["code"] = 2;
        data["describe"] = "关节PID运算溢出";
        data["cause"] = "伺服PID运算超出限制";
        data["solution"] = "联系技术人员处理";
        break;
    }
    case 0x105211:
    case 0x115211:
    case 0x125211:
    case 0x135211:
    case 0x145211:
    case 0x155211:
    {
        data["code"] = 2;
        data["describe"] = "关节型号选择错误";
        data["cause"] = "硬件驱动板与伺服参数不匹配";
        data["solution"] = "请联系技术人员进行检查关节硬件版本与伺服参数是否存在异常";
        break;
    }
    case 0x104210:
    case 0x114210:
    case 0x124210:
    case 0x134210:
    case 0x144210:
    case 0x154210:
    {
        data["code"] = 2;
        data["describe"] = "关节电机过温";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x105210:
    case 0x115210:
    case 0x125210:
    case 0x135210:
    case 0x145210:
    case 0x155210:
    {
        data["code"] = 2;
        data["describe"] = "关节参数设置与硬件功率不匹配";
        data["cause"] = "硬件驱动板、电机品牌型号、伺服参数，这三者不匹配";
        data["solution"] = "1.请联系技术人员进行检查关节生产参数是否存在异常;2.请联系技术人员进行检查关节驱动板是否存在异常";
        break;
    }
    case 0x105282:
    case 0x115282:
    case 0x125282:
    case 0x135282:
    case 0x145282:
    case 0x155282:
    {
        data["code"] = 2;
        data["describe"] = "关节EEPROM错误";
        data["cause"] = "硬件EEPROM芯片读写出错";
        data["solution"] = "1.请尝试对机器人进行重新多次上下电测试，检查是否存在时序波动，若仍存在问题，请联系技术人员;2.请联系技术人员进行检查关节驱动板是否存在异常";
        break;
    }
    case 0x105283:
    case 0x115283:
    case 0x125283:
    case 0x135283:
    case 0x145283:
    case 0x155283:
    {
        data["code"] = 2;
        data["describe"] = "关节上使能失败";
        data["cause"] = "上使能过程中，由于系统其他故障导致使能失败";
        data["solution"] = "请查看系统中是否存在其他报错信息，将其他报错信息进行处理后，再进行上使能操作";
        break;
    }
    case 0x106010:
    case 0x116010:
    case 0x126010:
    case 0x136010:
    case 0x146010:
    case 0x156010:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器温度过热";
        data["cause"] = "编码器温度状态异常";
        data["solution"] = "1.请检查关节温度是否超出使用范围要求，请降低使用工况;2.请联系技术人员检查关节或编码器是否存在异常;";
        break;
    }
    case 0x107180:
    case 0x117180:
    case 0x127180:
    case 0x137180:
    case 0x147180:
    case 0x157180:
    {
        data["code"] = 2;
        data["describe"] = "关节电机过载(I2T)";
        data["cause"] = "电机输出大电流，并且持续了一段时间";
        data["solution"] = "1.请检查机器人报警过载之前是否发生了碰撞;2.请检查关节实际的负载是否已经严重超出机器人的标称负载;3.请联系技术人员检查报警关节的参数;4.请通过拖拽模式检查关节制动器机构是否异常;5.请联系技术人员检查关节是否出现机械性卡涩;6.请联系技术人员检查转子ABZ编码器是否读取异常;";
        break;
    }
    case 0x107181:
    case 0x117181:
    case 0x127181:
    case 0x137181:
    case 0x147181:
    case 0x157181:
    {
        data["code"] = 2;
        data["describe"] = "关节电机抱闸故障";
        data["cause"] = "未监测到电磁铁";
        data["solution"] = "1.请检查关节电磁铁接线是否异常;2.请检查测量电磁铁阻值是否正常;";
        break;
    }
    case 0x107182:
    case 0x117182:
    case 0x127182:
    case 0x137182:
    case 0x147182:
    case 0x157182:
    {
        data["code"] = 2;
        data["describe"] = "关节高频注入反向";
        data["cause"] = "电机实际磁极方向与脉冲注入计算不一致，出现控制异常";
        data["solution"] = "1.请联系技术人员查看电机参数是否正确;2.请检查电机相序接线是否正确;3.请联系技术人员检查关节驱动板是否异常";
        break;
    }
    case 0x107386:
    case 0x117386:
    case 0x127386:
    case 0x137386:
    case 0x147386:
    case 0x157386:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器内部错误";
        data["cause"] = "废弃";
        data["solution"] = "请检查伺服是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x107580:
    case 0x117580:
    case 0x127580:
    case 0x137580:
    case 0x147580:
    case 0x157580:
    {
        data["code"] = 2;
        data["describe"] = "关节动力学超限";
        data["cause"] = "转矩前馈超出伺服阈值";
        data["solution"] = "联系技术人员处理";
        break;
    }
    case 0x103211:
    case 0x113211:
    case 0x123211:
    case 0x133211:
    case 0x143211:
    case 0x153211:
    {
        data["code"] = 2;
        data["describe"] = "关节驱动板动力电源故障";
        data["cause"] = "硬件驱动板损坏";
        data["solution"] = "联系技术人员处理";
        break;
    }
    case 0x107388:
    case 0x117388:
    case 0x127388:
    case 0x137388:
    case 0x147388:
    case 0x157388:
    {
        data["code"] = 2;
        data["describe"] = "关节编码器磁信号异常";
        data["cause"] = "编码器信号幅值错误、磁模式错误、信号丢失、信号异常";
        data["solution"] = "1.请查看是否为固定关节报错，请联系技术人员检查关节或编码器是否异常;2.请查看机器人工作环境或本体是否有外部信号或磁信号干扰;";
        break;
    }
    case 0x108000:
    case 0x118000:
    case 0x128000:
    case 0x138000:
    case 0x148000:
    case 0x158000:
    {
        data["code"] = 2;
        data["describe"] = "关节位置偏离";
        data["cause"] = "根据伺服位置跟随误差判断碰撞检测";
        data["solution"] = "1.请检查机器人是否发生碰撞;2.请检查程序加速度是否设置过大;3.请检查运动段转接参数设置是否存在异常;4.请检查机器人负载设置是否正确";
        break;
    }
    case 0x108001:
    case 0x118001:
    case 0x128001:
    case 0x138001:
    case 0x148001:
    case 0x158001:
    {
        data["code"] = 2;
        data["describe"] = "关节位置偏离报警";
        data["cause"] = "根据伺服位置跟随误差判断碰撞检测";
        data["solution"] = "1.请检查机器人是否发生碰撞;2.请检查程序加速度是否设置过大;3.请检查机器人是否负载超出要求范围;4.请检查软件中机器人安装姿态与实际姿态是否一致;5.请检查运动中是否错误使用运动段转接;";
        break;
    }
    case 0x105201:
    case 0x115201:
    case 0x125201:
    case 0x135201:
    case 0x145201:
    case 0x155201:
    {
        data["code"] = 2;
        data["describe"] = "关节参数未解锁";
        data["cause"] = "R176版本开始伺服关键参数添加了写保护功能避免误操作导致伺服参数错误";
        data["solution"] = "请联系技术人员进行关节参数检查";
        break;
    }
    case 0x105202:
    case 0x115202:
    case 0x125202:
    case 0x135202:
    case 0x145202:
    case 0x155202:
    {
        data["code"] = 2;
        data["describe"] = "关节校零与DH参数冲突";
        data["cause"] = "进行机械零位校准时，伺服会检测当前机型出厂前是否经过DH参数标定，已标定的机型使用机械零位校准功能会造成DH存在错误，最终造成机器人精度丢失";
        data["solution"] = "请联系技术人员协助检查";
        break;
    }
    case 0x108616:
    case 0x118616:
    case 0x128616:
    case 0x138616:
    case 0x148616:
    case 0x158616:
    {
        data["code"] = 2;
        data["describe"] = "关节温度传感器通信异常";
        data["cause"] = "关节内部温度传感器异常";
        data["solution"] = "请检测IIC接口温度传感器是否异常";
        break;
    }
    case 0x201104:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO RTU 串行总线参数不一致";
        data["cause"] = "配置了多个RTU 扩展IO模块且个模块串行总线参数不一致";
        data["solution"] = "修改扩展IO RTU 串行总线参数使各模块参数与第一个RTU模块的参数一样";
        break;
    }
    case 0x201102:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO初始化期间 创建Modbus Rtu连接失败";
        data["cause"] = "初始化时根据给定配置连接Modbus从站IO模块时出错";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x201202:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO初始化期间 创建Modbus Tcp连接失败";
        data["cause"] = "初始化时根据给定配置连接Modbus从站IO模块时出错";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x201304:
    {
        data["code"] = 2;
        data["describe"] = "初始化期间未知错误";
        data["cause"] = "初始化时根据给定配置连接Modbus从站IO模块时出错";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x201101:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO初始化失败 Modbus RTU通讯参数不匹配";
        data["cause"] = "初始化时根据给定配置连接Modbus从站IO模块时出错";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x201201:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO初始化失败 Modbus TCP通讯参数不匹配";
        data["cause"] = "初始化时根据给定配置连接Modbus从站IO模块时出错";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x202103:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO运行时失败 Modbus RTU节点断线";
        data["cause"] = "运行过程中Modbus RTU扩展的IO模块与控制器通讯断开";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x202102:
    {
        data["code"] = 2;
        data["describe"] = "扩展IO运行时失败 Modbus TCP节点断线";
        data["cause"] = "运行过程中Modbus TCP扩展的IO模块与控制器通讯断开";
        data["solution"] = "1.请确认扩展IO模块的类型与通讯配置;2.请确认控制柜接口与外部扩展IO模块的通讯物理连接正常;3.请确认扩展IO模块供电正常;4.可以尝试使用Modbus Poll工具连接扩展IO检查扩展IO模块是否异常;";
        break;
    }
    case 0x3F0001:
    {
        data["code"] = 2;
        data["describe"] = "力矩传感器连接初始化失败";
        data["cause"] = "在与传感器打开时，会与传感器间根据通讯配置建立连接。当控制器与传感器间建立通讯连接失败时，会返回该错误";
        data["solution"] = "1.请确认力矩传感器类型与通讯配置;2.请确认控制柜接口与力矩传感器的通讯物理连接正常;3.请确认力矩传感器供电正常;4.可以尝试使用Modbus调试工具或网络调试助手工具连接力矩传感器检查力矩传感器是否异常;";
        break;
    }
    case 0x3F1001:
    {
        data["code"] = 2;
        data["describe"] = "接收力矩传感器数据失败";
        data["cause"] = "控制器与传感器间建立连接后，运行过程中数据断开时报此错误";
        data["solution"] = "1.请确认力矩传感器类型与通讯配置;2.请确认控制柜接口与力矩传感器的通讯物理连接正常;3.请确认力矩传感器供电正常;4.可以尝试使用Modbus调试工具或网络调试助手工具连接力矩传感器检查力矩传感器是否异常;";
        break;
    }
    case 0x3F1002:
    {
        data["code"] = 2;
        data["describe"] = "接收力矩传感器数据格式错误";
        data["cause"] = "该错误一般出现在通过TIO扩展力矩传感器时，接收的力矩传感器数据格式错误时报错";
        data["solution"] = "1.请确认力矩传感器类型与通讯配置;2.尝试使用Modbus调试工具、网络调试助手工具或串口调试工具分析接收到的力矩传感器数据，以判断其是否符合JAKA+力矩传感器的通讯协议;";
        break;
    }
    case 0x304281:
    {
        data["code"] = 2;
        data["describe"] = "PDU温度异常";
        data["cause"] = "控制柜内部温度超过70℃";
        data["solution"] = "1.请检查控制柜内部温度是否超过70℃;2.请检查控制柜内部风扇是否工作正常;";
        break;
    }
    case 0x304282:
    {
        data["code"] = 2;
        data["describe"] = "制动电阻过温";
        data["cause"] = "MiniCAB内部制动电阻温度超过80℃";
        data["solution"] = "1.请检查MiniCAB内部温度;2.请降低机器人运行的加速度;3.请添加散热风扇;";
        break;
    }
    case 0x303281:
    {
        data["code"] = 2;
        data["describe"] = "5V异常（电源电压的波动范围）";
        data["cause"] = "控制柜内部5V信号电压值超过内部预设值（3.5~6.1V），可以使用万用表测试5V信号电压值";
        data["solution"] = "1.请检查固件版本是否为最新版本，若不是更新到最新版本后查看是否还存在该问题;2.控制柜输入电源断开后重新供电后开机查看是否还存在该问题，若存在请联系技术人员进行检查控制柜硬件;3.对于标准220V供电控制柜，拔掉220V电源必定报该故障，属于正常现象;";
        break;
    }
    case 0x303282:
    {
        data["code"] = 2;
        data["describe"] = "12V异常（电源电压的波动范围）";
        data["cause"] = "控制柜内部12V信号电压值超过内部预设值(9~14V)，可以使用万用表测量12V信号电压值";
        data["solution"] = "1.请检查固件版本是否为最新版本，若不是更新到最新版本后查看是否还存在该问题;2.控制柜输入电源断开后重新供电后开机查看是否还存在该问题，若存在请联系技术人员进行检查控制柜硬件;3.对于标准220V供电控制柜，拔掉220V电源必定报该故障，属于正常现象;";
        break;
    }
    case 0x303283:
    {
        data["code"] = 2;
        data["describe"] = "24V异常（电源电压的波动范围）";
        data["cause"] = "控制柜内部12V信号电压值超过内部预设值(9~14V)，可以使用万用表测量12V信号电压值";
        data["solution"] = "1.请检查固件版本是否为最新版本，若不是更新到最新版本后查看是否还存在该问题;2.控制柜输入电源断开后重新供电后开机查看是否还存在该问题，若存在请联系技术人员进行检查控制柜硬件;3.对于标准220V供电控制柜，拔掉220V电源必定报该故障，属于正常现象;";
        break;
    }
    case 0x303181:
    {
        data["code"] = 2;
        data["describe"] = "220V供电异常";
        data["cause"] = "控制柜检测220V信号的幅值和频率异常";
        data["solution"] = "请检查固件版本是否为最新版本，若不是更新到最新版本后查看是否还存在该问题;";
        break;
    }
    case 0x303182:
    {
        data["code"] = 2;
        data["describe"] = "主供电继电器异常";
        data["cause"] = "控制48V输出的继电器在未上电情况下检测到输出信号，即控制48V电源的输入信号的继电器出现粘连";
        data["solution"] = "请检查固件版本是否为最新版本，若不是更新到最新版本后查看是否还存在该问题;";
        break;
    }
    case 0x303381:
    {
        data["code"] = 2;
        data["describe"] = "本体电压或电压配置异常";
        data["cause"] = "MiniCAB设置的泄放电压值小于MiniCAB的输入电压值";
        data["solution"] = "请使用APP重新设置泄放电压;";
        break;
    }
    case 0x303387:
    {
        data["code"] = 2;
        data["describe"] = "PSCB继电器异常";
        data["cause"] = "关闭本体电源后，PSCB检测到的控制本体电源的两个继电器电压值不一致";
        data["solution"] = "1.请更新到最新版本固件后查看是否还存在该问题;2.若前面操作后还存在，请联系技术人员检查PSCB内部继电器是否损坏;";
        break;
    }
    case 0x302384:
    {
        data["code"] = 2;
        data["describe"] = "用户IO供电电流异常（2.3A)";
        data["cause"] = "控制柜面板上24V输出总的电流值超过1.5A";
        data["solution"] = "1.请拆除控制柜面板上器件后查看是否还报该故障;2.若执行步骤1后未出现报错，则用户外接设备不能使用控制柜进行供电，需要单独供电;3.若执行步骤1后仍然报错，尝试关机重启，若仍然报错，请联系技术人员检查硬件是否损坏;";
        break;
    }
    case 0x302385:
    {
        data["code"] = 2;
        data["describe"] = "工控机电流异常（工控机电流超过1.5A则认为工控机短路故障，上报错误）";
        data["cause"] = "开机后没有接工控机或工控机电流超过1.5A";
        data["solution"] = "请联系技术人员检查工控机硬件是否异常";
        break;
    }
    case 0x302380:
    {
        data["code"] = 2;
        data["describe"] = "风扇电流异常";
        data["cause"] = "控制柜风扇未接或风扇短路";
        data["solution"] = "请检查风扇故障状态";
        break;
    }
    case 0x302381:
    {
        data["code"] = 2;
        data["describe"] = "输出本体供电电流异常1级预警：25A 机器人本体电流消耗异常";
        data["cause"] = "SCB采集到的电流超过设定阈值";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x302382:
    {
        data["code"] = 2;
        data["describe"] = "输出本体供电电流异常2级预警：31.25A";
        data["cause"] = "SCB采集到的电流超过设定阈值";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x302383:
    {
        data["code"] = 2;
        data["describe"] = "输出本体供电电流异常3级预警：37.25A";
        data["cause"] = "SCB采集到的电流超过设定阈值";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x302391:
    {
        data["code"] = 2;
        data["describe"] = "本体功率异常";
        data["cause"] = "安全控制板计算的本体的功率超过设定限制值";
        data["solution"] = "1.请在APP里面重新调整安全设置里的功率设置;2.请联系技术服务人员排查是否在硬件上存在功率超限的问题;";
        break;
    }
    case 0x309081:
    {
        data["code"] = 2;
        data["describe"] = "拖拽TCP速度超限";
        data["cause"] = "本体TCP拖拽速度超过1m/s";
        data["solution"] = "请降低拖拽速度，该报警不影响其他功能，仅提示";
        break;
    }
    case 0x309082:
    {
        data["code"] = 2;
        data["describe"] = "紧急停止";
        data["cause"] = "手柄急停、用户急停、安全功能IO急停信号中的任意一个被触发";
        data["solution"] = "请检查手柄急停、用户急停、安全功能IO急停信号哪一个被触发";
        break;
    }
    case 0x308181:
    {
        data["code"] = 2;
        data["describe"] = "手柄CAN通信中断";
        data["cause"] = "安全控制板与手柄总线的数据出错";
        data["solution"] = "1.请检查手柄与电控柜线缆连接是否正常;2.请联系技术人员检查SCB/PSCB与控制柜CAN2之间的CAN总线是否异常;";
        break;
    }
    case 0x308182:
    {
        data["code"] = 2;
        data["describe"] = "控制器CAN通信中断";
        data["cause"] = "打开机器人电源后一段时间没有接收到控制器发送到本体的指令";
        data["solution"] = "1.请将SCB、PSCB固件更新到最新版本后查看是否存在该故障;2.在APP监控或伺服上位机监控页面查看1~6关节的数据是否有刷新;3.请查看本体末端指示灯是否亮，若不亮请检查接线是否正常;";
        break;
    }
    case 0x308183:
    {
        data["code"] = 2;
        data["describe"] = "本体CAN通信中断";
        data["cause"] = "打开机器人电源后一段时间没有接收到控制器发送到本体的指令";
        data["solution"] = "1.请将SCB、PSCB固件更新到最新版本后查看是否存在该故障;2.在APP监控或伺服上位机监控页面查看1~6关节的数据是否有刷新;3.请查看本体末端指示灯是否亮，若不亮请检查接线是否正常;";
        break;
    }
    case 0x308184:
    {
        data["code"] = 2;
        data["describe"] = "TIO CAN通信中断";
        data["cause"] = "打开机器人电源后一段时间没有接收到控制器发送到本体的指令";
        data["solution"] = "1.请将SCB、PSCB固件更新到最新版本后查看是否存在该故障;2.在APP监控或伺服上位机监控页面查看1~6关节的数据是否有刷新;3.请查看本体末端指示灯是否亮，若不亮请检查接线是否正常;";
        break;
    }
    case 0x308185:
    {
        data["code"] = 2;
        data["describe"] = "等待CAN通信正常超时";
        data["cause"] = "打开机器人电源后一段时间没有接收到控制器发送到本体的指令";
        data["solution"] = "1.请将SCB、PSCB固件更新到最新版本后查看是否存在该故障;2.在APP监控或伺服上位机监控页面查看1~6关节的数据是否有刷新;3.请查看本体末端指示灯是否亮，若不亮请检查接线是否正常;";
        break;
    }
    case 0x305081:
    {
        data["code"] = 2;
        data["describe"] = "手柄急停信号不一致";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请尝试更换手柄，或联系技术人员检查柜子SCB线路";
        break;
    }
    case 0x305082:
    {
        data["code"] = 2;
        data["describe"] = "用户急停信号输入不一致";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板p8端子是否接触不良，并检查外接电路是否正常";
        break;
    }
    case 0x305083:
    {
        data["code"] = 2;
        data["describe"] = "保护性停止信号输入不一致";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板p8端子是否接触不良，并检查外接电路是否正常";
        break;
    }
    case 0x305084:
    {
        data["code"] = 2;
        data["describe"] = "SCB继电器异常";
        data["cause"] = "废弃";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x305085:
    {
        data["code"] = 2;
        data["describe"] = "制动电阻过温";
        data["cause"] = "废弃";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x305086:
    {
        data["code"] = 2;
        data["describe"] = "手柄使能输入异常";
        data["cause"] = "废弃";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0x305087:
    {
        data["code"] = 2;
        data["describe"] = "附加急停输入异常";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板已配置DI接口端子是否接触不良，并检查外界电路是否正常";
        break;
    }
    case 0x305088:
    {
        data["code"] = 2;
        data["describe"] = "附加保护性停止输入异常";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板已配置DI接口端子是否接触不良，并检查外界电路是否正常";
        break;
    }
    case 0x305089:
    {
        data["code"] = 2;
        data["describe"] = "保护性停止复位输入异常";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板已配置DI接口端子是否接触不良，并检查外界电路是否正常";
        break;
    }
    case 0x30508A:
    {
        data["code"] = 2;
        data["describe"] = "缩减模式输入异常";
        data["cause"] = "该信号为双链路冗余通道，两路信号不一致时报错";
        data["solution"] = "请检查面板已配置DI接口端子是否接触不良，并检查外界电路是否正常";
        break;
    }
    case 0x30508B:
    {
        data["code"] = 2;
        data["describe"] = "三位置使能输入异常";
        data["cause"] = "三位置使能输入异常";
        data["solution"] = "";
        break;
    }
    case 0x305090:
    {
        data["code"] = 2;
        data["describe"] = "关闭碰撞检测信号输入异常";
        data["cause"] = "关闭碰撞检测信号输入异常";
        data["solution"] = "";
        break;
    }
    case 0x305091:
    case 0x305092:
    case 0x305093:
    case 0x305094:
    case 0x305095:
    {
        data["code"] = 2;
        data["describe"] = "碰撞灵敏度LV1信号输入异常";
        data["cause"] = "碰撞灵敏度LV1信号输入异常";
        data["solution"] = "";
        break;
    }
    case 0x305097:
    {
        data["code"] = 2;
        data["describe"] = "碰撞灵敏度极低信号输入异常";
        data["cause"] = "碰撞灵敏度极低信号输入异常";
        data["solution"] = "";
        break;
    }
    case 0x303184:
    {
        data["code"] = 2;
        data["describe"] = "安全数字输入信号存在异常，安全控制板检测到异常故障并未被清除，拒绝对机器人重新上电的要求";
        data["cause"] = "请检查控制柜面板配置的安全数字输入信号是否存在异常，确认安全数字输入信号输入无异常后重新上电清除故障";
        data["solution"] = "";
        break;
    }
    case 0x309083:
    {
        data["code"] = 2;
        data["describe"] = "机器人整机功率报警阈值";
        data["cause"] = "废弃";
        data["solution"] = "请检查SCB是否为调试版本，或联系技术服务人员提供相关错误码描述信息";
        break;
    }
    case 0xE000B:
    {
        data["code"] = 3;
        data["describe"] = "计算工具中心点失败";
        data["cause"] = "计算工具中心点失败";
        data["solution"] = "工具坐标系计算错误，请检查设置的工具坐标系是否正确";
        break;
    }
    default:
    {
        data["code"] = 2;
        data["describe"] = "其它错误";
        data["cause"] = "";
        data["solution"] = "";
        break;
    }
    }
    return data;
}
